\documentclass{beamer}

\usetheme{egee}
\usepackage[utf8]{inputenc}
\usepackage{fmtcount}
\usepackage{listings}

\begin{document}

\title{Deska: A Dashboard for a Grid Site\\
Usage}
\author{Tomáš Hubík \& Lukáš Kerpl}
\date{
%% leave the following line alone
   {EGEE-III INFSO-RI-222667}  
%% edit the next line
\hfill
IS II, MFF UK Prague, \today
}
\begin{frame}
\maketitle
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> 
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Add host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host             
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host                 tab pressed
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
Add host "hpv2"? [y]/n
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
y
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
Host "hpv2" added.
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2> end
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv3
Add host "hpv3"? [y]/n
n
Cancelling.
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
golias10    golias13    hpv2    ui5
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> rolw wn
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
ui6         ui7         zr4     zr8
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host hpv2
db host hpv2> int eth0
Add int "eth0"? [y]/n
y
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2 int eth0> ip 192.168.1.5/24
db host hpv2 int eth0> mac 00:15:48:ef:a1:55
db host hpv2 int eth0> vlan 25
db host hpv2 int eth0> show
ip 192.168.1.5/24
mac 00:15:48:ef:a1:55
vlan 25
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2> show-all
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2> show-all
int eth0
    ip 192.168.1.5/24
    mac 00:15:48:ef:a1:55
    vlan 25
role wn
serial 123456789
db host hpv2>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2 int eth0> end
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2> show-all
int eth0
    ip 192.168.1.5/24
    mac 00:15:48:ef:a1:55
    vlan 25
role wn
serial 123456789
db host hpv2> end
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2> show-all
int eth0
    ip 192.168.1.5/24
    mac 00:15:48:ef:a1:55
    vlan 25
role wn
serial 123456789
db host hpv2> end
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db host hpv2> role wn
db host hpv2> serial 123456789
db host hpv2> show
int eth0
role wn
serial 123456789
db host hpv2> show-all
int eth0
    ip 192.168.1.5/24
    mac 00:15:48:ef:a1:55
    vlan 25
role wn
serial 123456789
db host hpv2> end
db> commit
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
    mac 00:15:48:ef:a1:55
    vlan 25
role wn
serial 123456789
db host hpv2> end
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
    vlan 25
role wn
serial 123456789
db host hpv2> end
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
serial 123456789
db host hpv2> end
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
serial 123456789
db host hpv2> end
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> commit
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
Changes:
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
host hpv2
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
    int eth0
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
        ip 192.168.1.5/24
        mac 00:15:48:ef:a1:55
        vlan 25
    role wn
    serial 123456789
Commit changes? [y]/n
y
Changes committed successfully.
db> hsot hpv4
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db> commit
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
Unknown type "hsot".
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db> commit
Changes:
host golias10
    int eth0
        ip 128.15.24.189/24
        mac 11:15:48:ef:a1:55
        vlan 25
        switch sw253
        port ge4-15
Commit changes? [y]/n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db> host golias10
db golias10> int eth0 ip 128.15.24.189/24 mac 11:
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db> commit
Changes:
host golias10
    int eth0
        ip 128.15.24.189/24
        mac 11:15:48:ef:a1:55
        vlan 25
        switch sw253
        port ge4-15
Commit changes? [y]/n
n
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db> commit
Changes:
host golias10
    int eth0
        ip 128.15.24.189/24
        mac 11:15:48:ef:a1:55
        vlan 25
        switch sw253
        port ge4-15
Commit changes? [y]/n
n
Changes discarted.
db>
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
15:48:ef:a1:55 vlan 25 switch sw253 port ge4-15
db golias10> end
db> commit
Changes:
host golias10
    int eth0
        ip 128.15.24.189/24
        mac 11:15:48:ef:a1:55
        vlan 25
        switch sw253
        port ge4-15
Commit changes? [y]/n
n
Changes discarted.
db> exit
\end{lstlisting}
\end{frame}

\begin{frame}[fragile]
\frametitle{Edit host}
\begin{lstlisting}
db golias10> end
db> commit
Changes:
host golias10
    int eth0
        ip 128.15.24.189/24
        mac 11:15:48:ef:a1:55
        vlan 25
        switch sw253
        port ge4-15
Commit changes? [y]/n
n
Changes discarted.
db> exit
Bye!
\end{lstlisting}
\end{frame}

\begin{frame}
\frametitle{Thank you}
\center
{\Large Thanks for your attention!}
\end{frame}

\end{document}
